export const mockNewGamesData = {
  data: {
    games: [
      {
        href: 1,
        name: 'Jugglers Tale',
        img: '/images/popular/jugglers-tale.png',
      },
      {
        href: 2,
        name: 'Atomic Heart',
        img: '/images/popular/atomic.jpg',
      },
      {
        href: 3,
        name: 'Smurfs',
        img: '/images/popular/smurfs.jpg',
      },
    ],
  },
};

export const mockTopGamesData = {
  data: {
    games: [
      {
        href: 4,
        name: 'Assassin’s Creed Valhalla',
        img: '/images/top/assasin.png',
      },
      {
        href: 5,
        name: 'Demons Souls',
        img: '/images/top/demons.png',
      },
      {
        href: 6,
        name: 'Control',
        img: '/images/top/control.png',
      },
      {
        href: 7,
        name: 'Forza Horizon 5',
        img: '/images/top/forzahorizon5.jpg',
      },
      {
        href: 8,
        name: 'Mortal Combat 11',
        img: '/images/top/mortal.jpg',
      },
      {
        href: 9,
        name: 'Chernobylite',
        img: '/images/top/chernobil.jpg',
      },
    ],
  },
};

export const mockSwiperData = {
  data: {
    games: [
      {
        id: 1,
        title: "A Juggler's Tale",
        description:
          "A Juggler's Tale — это кинематографический платформер с головоломками. Играйте за марионетку Эбби и путешествуйте по средневековому сказочному миру, чтобы обрести свободу. Используйте нити марионетки в уникальных головоломках, обходите препятствия и ускользайте от неумолимых головорезов, которые идут по вашим следам, — пока кукольник крепко держит нити в своих руках. ИСТОРИЯ «Дамы и господа! Заходите, заходите! Расположены послушать историю, не так ли?»Эбби — артистка, пленённая в цирке. Днём она развлекает публику, а ночи проводит в клетке, жаждая свободы..",
        preview: '/images/popular/jugglers-tale.png',
        date_exit: '29.09.2021',
        language: 'Русский (интерфейс, субтитры)',
        price: 239,
        category_id: 1,
        genre_id: 6,
        created_at: '2025-06-02T11:53:11.000000Z',
        updated_at: '2025-06-02T11:53:11.000000Z',
      },
      {
        id: 2,
        title: 'Atomic Heart',
        description:
          'Atomic Heart – захватывающий шутер от первого лица, который стал настоящей сенсацией на игровом рынке. Эта мрачная и загадочная игра погрузит вас в альтернативную вселенную, где технологии и мистика переплетаются в удивительный сюжет. Станьте героем, исследуйте таинственное открытое пространство и раскройте грандиозный заговор.',
        preview: '/images/popular/atomic.jpg',
        date_exit: '21.02.2023',
        language: 'Русский (Полная локализация)',
        price: 499,
        category_id: 1,
        genre_id: 6,
        created_at: '2025-06-02T11:53:11.000000Z',
        updated_at: '2025-06-02T11:53:11.000000Z',
      },
      {
        id: 3,
        title: 'The Smurfs - Dreams',
        description:
          'В мире, где волшебство и приключения переплетаются, игра The Smurfs - Dreams предлагает захватывающий опыт новым и давним поклонникам синеньких человечков. Погрузитесь в атмосферу красочного страны смурфов, где каждое приключение приносит уникальные задания и неожиданные повороты. Чтобы наслаждаться всеми прелестями The Smurfs - Dreams, у вас есть возможность арендовать аккаунт или купить игру на платформе PSN. Благодаря удобной системе проката, вы можете попробовать игру на PS4 или PS5, прежде чем принимать решение о покупке. Не упустите шанс исследовать удивительные локации, выполняя миссии вместе с любимыми персонажами! Эта игра не только развлекает, но и погружает в уникальную игровую механику, которая подойдет как для опытных геймеров, так и для новичков.',
        preview: '/images/popular/smurfs.jpg',
        date_exit: '24.10.2024',
        language: 'Русский (Полная локализация)',
        price: 499,
        category_id: 2,
        genre_id: 7,
        created_at: '2025-06-02T11:53:20.000000Z',
        updated_at: '2025-06-02T11:53:20.000000Z',
      },
      {
        id: 4,
        title: 'Assassin’s Creed Valhalla',
        description:
          "Assassin's Creed Valhalla – это новая часть огромно популярной серии игр, разработанная студией Ubisoft. Погрузитесь в захватывающий мир викингов и отправьтесь в эпическое путешествие по землям Скандинавии. Но что, если вы не хотите тратить много денег на приобретение игры? В таком случае вам может быть интересна услуга аренды игрового аккаунта. Многие игроки предпочитают заниматься прокатом с помощью PlayStation Network (PSN), что позволяет им играть в несколько разных игр, не покупая каждую отдельно.Если вы решите купить собственный экземпляр игры Assassin's Creed Valhalla, то вы сможете наслаждаться ней в любое время и на любой консоли. Игра доступна как на PS4, так и на PS5, что делает её доступной для широкого круга игроков.Assassin's Creed Valhalla предлагает невероятное сочетание боевых сражений, исследования мира и захватывающего сюжета. Станьте отважным викингом, основывайте свое поселение, сражайтесь с врагами и великими героями, исследуйте новые земли и примите вызов судьбы, чтобы стать легендарным вождем.Не упустите шанс окунуться в увлекательный мир Assassin's Creed Valhalla. Решайте, хотите ли вы воспользоваться арендой игрового аккаунта через PSN или приобрести собственную копию этой потрясающей игры для PS4 или PS5. Уверены, что она станет настоящим боевиком в вашей коллекции игр.",
        preview: '/images/top/assasin.png',
        date_exit: '10.11.2020',
        language: 'Русский (Полная локализация)',
        price: 179,
        category_id: 2,
        genre_id: 7,
        created_at: '2025-06-02T11:53:20.000000Z',
        updated_at: '2025-06-02T11:53:20.000000Z',
      },
      {
        id: 5,
        title: "Demon's Souls",
        description:
          "Данная игра работает только на PS5Demon's Souls Remake - это переиздание самой первой игры Souls-серии, которая изначально вышла эксклюзивно на PlayStation 3 в 2009 году. Игроков ждут обновленная графика и множество иных разнообразных исправлений и улучшений.",
        preview: '/images/top/demons.png',
        date_exit: '12.11.2020',
        language: 'Русский (интерфейс, субтитры)',
        price: 299,
        category_id: 2,
        genre_id: 31,
        created_at: '2025-06-02T11:53:40.000000Z',
        updated_at: '2025-06-02T11:53:40.000000Z',
      },
      {
        id: 6,
        title: 'Control',
        description:
          'Control - шутер от третьего лица разработанный Remedy Entertainment. Обладательница сверх естественных навыков Джесси Фейден устраивается на службу в Федеральное Бюро Контроля, находящееся в Нью-Йорке, чтобы получить ответы о тайне своего прошлого. Неожиданно ее назначают директором ФБК и придя на работу она замечает, что все сотрудники поражены загадочной внеземной болезнью. Теперь ей необходимо противостоять зараженным и параллельно получить отгадки по имеющимся вопросам.Из оружия у героини будут необычные дробовик и пистолет. Также она наделена даром притягивать к себе силой мысли различные предметы, швыряться ими в противника, создавать из них вокруг себя непроницаемый барьер. Некоторые игровые локации будут доступны по истечении некоторого времени и по мере обследования других уровней.',
        preview: '/images/top/control.png',
        date_exit: '27.08.2019',
        language: 'Русский (интерфейс, субтитры)',
        price: 239,
        category_id: 1,
        genre_id: 18,
        created_at: '2025-06-02T11:53:35.000000Z',
        updated_at: '2025-06-02T11:53:35.000000Z',
      },
      {
        id: 7,
        title: 'Forza Horizon 5',
        description:
          'Добро пожаловать на фестиваль Horizon! Собирайте коллекцию автомобилей, дорабатывайте их на свой вкус и отправляйтесь в путь по лучшим дорогам Мексики. Путешествуйте по джунглям, пустыням, пляжам и различным климатическим зонам. Испытайте свои навыки в тяжёлых погодных условиях — вас ждёт вождение во время бурь, гроз, торнадо и не только. Исследуйте открытый мир мексиканских просторов в межплатформенной* игре с друзьями.',
        preview: '/images/top/forzahorizon5.jpg',
        date_exit: '29.04.2025',
        language: 'Русский (интерфейс, субтитры)',
        price: 599,
        category_id: 2,
        genre_id: 7,
        created_at: '2025-06-02T11:53:20.000000Z',
        updated_at: '2025-06-02T11:53:20.000000Z',
      },
      {
        id: 8,
        title: 'Mortal Kombat 11',
        description:
          'Mortal Kombat 11 - это одиннадцатая часть знаменитой серии файтингов, которая предлагает игрокам необычайно глубокую кастомизацию, улучшенный по сравнению с предыдущей частью движок, множество новых - и крайне брутальных - добиваний, а также новых и старых знакомых бойцов, многих из которых игроки знают более 20 лет. ',
        preview: '/images/top/mortal.jpg',
        date_exit: '26.05.2020',
        language: 'Русский (интерфейс, субтитры)',
        price: 320,
        category_id: 2,
        genre_id: 7,
        created_at: '2025-06-02T11:53:20.000000Z',
        updated_at: '2025-06-02T11:53:20.000000Z',
      },
      {
        id: 9,
        title: 'Chernobylite',
        description:
          'Chernobylite — научно-фантастическая ролевая игра в жанре ужасов с элементами выживания от студии The Farm 51. Отправляйтесь в невероятно реалистичную зону отчуждения, воссозданную с помощью 3D-сканеров, и играйте за ученого-физика Игоря Химинюка, ранее работавшего на Чернобыльской АЭС. Он вернулся в Припять, чтобы узнать, куда исчезла его невеста 30 лет назад. На пути к истине вы столкнетесь с охраняющими зону военными, другими сталкерами и сверхъестественными существами, а также иными опасностями, которые таит суровый окружающий мир.',
        preview: '/images/top/chernobil.jpg',
        date_exit: '28.09.2021',
        language: 'Русский (Полная локализация)',
        price: 390,
        category_id: 2,
        genre_id: 7,
        created_at: '2025-06-02T11:53:20.000000Z',
        updated_at: '2025-06-02T11:53:20.000000Z',
      },
    ],
  },
};
